/********************************************************
DAC应用－软件触发DAC变换，由ADC控制DAC输出大小
1.本实验硬件平台：NUAA_CM3_107实验开发板WEEEDK，MCU：STM32F107VCT6               
2.开发和实验环境：MDK-ARM Keil V5.15及其以上版本
3.例程使用的STM32F10x固件库V3.5.0
4.本实验例程现象说明内容：  
	DAC应用：采用软件触发方式进行D/A变换,由ADC采集的大小控制DAC输出大小
**************************************************************************************************/	

/* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include "hw_config.h"
#include "stm32f10x.h"
#include "lcd.h"
#include <stdio.h>
#include "hw_config.h"
#include "stm32f10x.h"
#include "dfh.h"
extern u8 gImage_fg[];

u8 key;
/* DAC地址0x4000 7400 - 0x4000 77FF，
   0x40007420地址属于DAC_DHR12RD
   双DAC的12位右对齐数据保持寄存器
*
音调与频率Hz的关系
低音   1	  2		 3		 4		5	   6		 7		
       261.5Hz	293.5Hz	329.5Hz	349Hz	392Hz	440Hz	494Hz	   
中音   1      2       3     4    5   6     7   
      523Hz	587Hz	659Hz	698Hz	784Hz	880Hz	988Hz
高音   1     2   3   4   5   6   7
      1046Hz	1175Hz	1318Hz	1397Hz	1568Hz	1760Hz	1967Hz

**************************************************************************************************/	

uint32_t DAC_DHR12R2_Address = 0x40007414;	  //0x4000 7400 - 0x4000 77FF为DAC地址范围，其中0x40007414为DAC2右对齐数据保持寄存器
//uint32_t DAC_DHR12RD_Address = 0x40007420;	  //0x4000 7400 - 0x4000 77FF为DAC地址范围，其中0x40007420为双通道DAC右对齐数据保持寄存器

const uint16_t Sine12bit[32] = {   /*32正弦波点*/
                      2047, 2447, 2831, 3185, 3498, 3750, 3939, 4056, 4095, 4056,
                      3939, 3750, 3495, 3185, 2831, 2447, 2047, 1647, 1263, 909, 
                      599, 344, 155, 38, 0, 38, 155, 344, 599, 909, 1263, 1647};

uint32_t DAC2Sine12bit[32];
const uint16_t frebit[24] = {   /*1,2,3,4,5,6,7,1频率*/
                     0,523,587,659,698,784,880,988,523*2,587*2,659*2,698*2,784*2,880*2,988*2,523*4,523*4,523/2,587/2,659/2,698/2,784/2,880/2,988/2};//1300, 1462, 1625, 1733, 1950, 2166, 2437, 2600,2600, 2437,2166, 1950, 1733,1625,1462,1300};
									// 无 1   2   3   4    5   6   7  
													//     5 
const uint16_t Redfrebit[ ] = {784*2,784*2,784*2,880*2,587*2,587*2,587*2,587*2,523*2,523*2,523*2,880,  587*2,587*2,587*2,587*2,
														 784*2,784*2,784*2,784*2,880*2,523*4,880*2,784*2, 523*2,523*2,523*2,880,  587*2,587*2,587*2,587*2,
														 784*2,784*2,587*2,587*2,523*2,523*2,988,  880,  784,  784,  784*2,784*2,587*2,587*2,659*2,587*2,
														 523*2,523*2,523*2,880,  587*2,659*2,587*2,523*2,587*2,523*2,988,  880,  784,  784,  784,  784,  
														 784,  784,  784,784,
															};  
/*1,2,3,4,5,6,7,1频率*/
//                              3     2    3      5     6     5     1'    6      5    3      5    5       5     5       6     6    (16)
const uint16_t  Jasmine[ ] = {659*2,587*2,659*2,784*2,880*2,784*2,523*4,880*2,784*2,659*2,784*2,784*2, 784*2,784*2, 880*2,880*2,
	//                   			   1'    1'    2'    3'	    2'    1'    6    1'     5    3      5     5      5      5       5     5 (16)
															523*4,523*4,587*4,659*4,587*4,523*4,880*2,523*4,784*2,659*2,784*2,784*2,  784*2,784*2, 784*2,784*2,														 
	//                   			   5     3      5    5	    5    5    6      6    1'   1'     2'    3'      6     6       5     5 (16)
															784*2,659*2,784*2,784*2,784*2,784*2,880*2,880*2,523*4,523*4,587*4,659*4,  880*2,880*2, 784*2,784*2,														 
	//                   			   5     5      2    2	    3    5    3      2    1      6.     1    1      1     1       1     1 (16)
															784*2,784*2,587*2,587*2,659*2,784*2,659*2,587*2,523*2,880,523*2,523*2,  523*2,523*2, 523*2,523*2, 														 
	//                   			   3     2      1    1	    2    2    2      3    5      5     6    1'      6     6       5     5 (16)
															659*2,587*2,523*2,523*2,587*2,587*2,587*2,659*2,784*2,784*2,880*2,523*4,  880*2,880*2, 784*2,784*2, 														 
	//                   			   5     5      2    2	    3    5    3      2    1      2     6.    6.'      6.   6.      1     1 (16)
															784*2,784*2,587*2,587*2,659*2,784*2,659*2,587*2,523*2,587*2,880, 880,   880,   880,   523*2, 523*2, 														 
//															 2     2      2    3	    1    2    1      6.    1     6.     5.    5.'      5.   5.      5.     5. (16)
															587*2,587*2,587*2,659*2,523*2,587*2,523*2,880,523*2,  880,   784, 784,       784,  784,  784, 784, 														 
															};   /*1,2,3,4,5,6,7,1频率*/
const uint16_t  my[ ] = {523/2,523,523*3,523*4,523*5,880*2,784*2,523*3,880*2,784*2,659*2,784*2,784*2, 784*2,784*2, 784*2,784*2,784*2,880*2,
	//                   			   1'    1'    2'    3'	    2'    1'    6    1'     5    3      5     5      5      5       5     5    5     5 (18)
															523*3,523*3,587*3,659*3,587*3,523*3,880*2,523*3,784*2,784*2,784*2,7840,  784*2,784*2, 784*2,784*2, 784*2,784*2, 587*2,587*2,587*2,587*2,
														 784*2,784*2,587*2,587*2,523*2,523*2,988,  880,  784,  784,  784*2,784*2,587*2,587*2,659*2,587*2,
														 523*2,523*2,523*2,880,  587*2,659*2,587*2,523*2,587*2,523*2,988,  880,  784,  784,  784,  784,  
														 784,  784,  784,784,
															};   /*1,2,3,4,5,6,7,1频率*/

int main(void)
{
uint8_t KEY=0;
uint8_t Idx,i;

		SystemInit();
		Delay_Init();               //使用SysTick实现精确延时
		GPIO_Configuration();
		DAC_Configuration();
		LCD_Init();																	/*  LCD初始化    */
		Welcome(); 										 							/*  显示主界面   */
		LED1(1);LED2(1);LED3(1);LED4(1);
		for (Idx = 0; Idx < 32; Idx++)
		{
		DAC2Sine12bit[Idx] = (Sine12bit[Idx] << 16) + (Sine12bit[Idx]);	  //将正弦波离散点装入指定DAC2Sine12bit[]中（DMA指定的外设地址）
		}
		DMA_Configuration();	   //DMA初始化
		TIM_Configuration(frebit[1]);	   //TIM3初始化
		DAC_Configuration();	   //DAC2初始化
		Delay_ms(300);
		TIM_Configuration(frebit[3]);	   //TIM3初始化
		Delay_ms(300);
		TIM_Configuration(frebit[5]);	   //TIM3初始化
		Delay_ms(300);
		TIM_Configuration(frebit[8]);	   //TIM3初始化
		Delay_ms(300);
	  TIM_Cmd(TIM3, DISABLE);	//不使能定时器（不让DAC输出）
	Gui_Drawbmp16(0,129,gImage_mao);
	POINT_COLOR =YELLOW;
	LCD_DrawRectangle(0,125,240,283);
	LCD_DrawRectangle(1,126,238,282);
	POINT_COLOR =RED;
	LCD_DrawRectangle(2,127,237,281);
	LCD_DrawRectangle(3,128,236,280);
	

	while(1)
	{		
		
		if (GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_11)==0) 
		{KEY=1;
		Gui_Drawbmp16(0,129,gImage_dfh);
	POINT_COLOR =YELLOW;
	LCD_DrawRectangle(0,125,240,283);
	LCD_DrawRectangle(1,126,238,282);
	POINT_COLOR =RED;
	LCD_DrawRectangle(2,127,237,281);
	LCD_DrawRectangle(3,128,236,280);
	}
		else {if (GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_12)==0) KEY=2;
		else {if (GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_13)==0) {KEY=3;Gui_Drawbmphua16(0,129,gImage_hua);}
		else {if (GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_0)==0) KEY=4;}}}
		
		switch (KEY)
		{		
		case 1:
			{
		for (i=0;i<68;i++)
			{
		if (GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_12)==0) {KEY=2;TIM_Cmd(TIM3, DISABLE);LED1(1);break;}		
		TIM_Configuration(Redfrebit[i]);	   								//TIM2赋值改变频率，发不同音调
		GPIOD->ODR^=(1<<2);
		Delay_ms(300);
		LED2(1);
			}
			break;	
			}
		case 3:
			{
		for (i=0;i<112;i++)
			{
				
				
		if (GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_12)==0) {KEY=2;TIM_Cmd(TIM3, DISABLE);LED1(1);break;}		
		TIM_Configuration(Jasmine[i]);	   								//TIM2赋值改变频率，发不同音调
		GPIOD->ODR^=(1<<2);
		Delay_ms(300);
		LED2(1);
			}
			break;	
			}
		case 4:
			{
		for (i=0;i<4;i++)
			{
		if (GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_12)==0) {KEY=2;TIM_Cmd(TIM3, DISABLE);LED1(1);break;}		
		TIM_Configuration(my[i]);	   								//TIM2赋值改变频率，发不同音调
		GPIOD->ODR^=(1<<2);
		Delay_ms(300);
		LED2(1);
			}
			break;	
			}
		case 2:
		{
	  TIM_Cmd(TIM3, DISABLE);	//不使能定时器（不让DAC输出）
		GPIOD->ODR^=(1<<3);
		Delay_ms(300);
			break;
		}
		}
		
}
	
}


/***********************END OF FILE****/
