/***********************************************************************
文件名称：Delay.C
功    能：定时器TIM1定时1秒，TIM2定时500ms，TIM3定时200ms，定时器到时分别使LED1、LED2和LED3改变状态（闪烁） 
编写时间：2017.3.29
编 写 人：
注    意：
***********************************************************************/
#include "stm32f10x.h"

/*********************************************
*函数名称：void Delayms(void)
*
*入口参数：N  ms
*
*出口参数：无
*
*功能说明：简单延时N ms
**********************************************/
void Delay_ms(uint16_t N)
{
	uint32_t i;
	for (i=0;i<(8000*N);i++);
}

